<a href="https://colab.research.google.com/github/aibees/anaconda_prods/blob/main/anova.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
from scipy.stats import f_oneway
from statsmodels.formula.api import ols
from statsmodels.stats.anova import anova_lm
from statsmodels.stats.multicomp import pairwise_tukeyhsd

/usr/local/lib/python3.7/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [4]:
df = pd.read_csv("diamonds.csv")

In [6]:
df.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0  326.0  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0  326.0  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0  327.0  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0  334.0  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0  335.0  4.34  4.35  2.75

In [7]:
df["color"].unique()

array(['E', 'I', 'J', 'H', 'F', 'G', 'D', nan], dtype=object)

In [11]:
stat, p = f_oneway(df.loc[df["color"] == "E", "price"],
                   df.loc[df["color"] == "I", "price"],
                   df.loc[df["color"] == "J", "price"])
print(round(stat, 3))
print(round(p, 3))

614.846
0.0

In [12]:
df_group = df.groupby("color")["price"].mean().reset_index()
df_group

  color        price
0     D  3445.032310
1     E  3309.401510
2     F  4062.553420
3     G  4386.713607
4     H  4871.435084
5     I  5624.464945
6     J  5892.229106

In [13]:
#ols, anova
bike = pd.read_csv("bike.csv")

In [15]:
model = ols(formula="temp ~ C(season)", data = bike).fit()
anova_lm(model)

                df         sum_sq        mean_sq            F  PR(>F)
C(season)      3.0  412885.270005  137628.423335  6040.687453     0.0
Residual   10882.0  247930.804947      22.783570          NaN     NaN

In [16]:
result = pairwise_tukeyhsd(bike["temp"], bike["season"])

In [17]:
print(result)

 Multiple Comparison of Means - Tukey HSD, FWER=0.05
=====================================================
group1 group2 meandiff p-adj  lower    upper   reject
-----------------------------------------------------
     1      2   10.293 0.001   9.9598  10.6262   True
     1      3  16.2586 0.001  15.9254  16.5918   True
     1      4   4.1187 0.001   3.7856   4.4519   True
     2      3   5.9656 0.001   5.6339   6.2974   True
     2      4  -6.1742 0.001   -6.506  -5.8425   True
     3      4 -12.1399 0.001 -12.4716 -11.8081   True
-----------------------------------------------------

In [18]:
#### question
bike.head()

              datetime  season  holiday  ...  casual  registered  count
0  2011-01-01 00:00:00       1        0  ...       3          13     16
1  2011-01-01 01:00:00       1        0  ...       8          32     40
2  2011-01-01 02:00:00       1        0  ...       5          27     32
3  2011-01-01 03:00:00       1        0  ...       3          10     13
4  2011-01-01 04:00:00       1        0  ...       0           1      1

[5 rows x 12 columns]

In [19]:
bike["weather"].unique()

array([1, 2, 3, 4])

In [21]:
bike["day"] = pd.to_datetime(bike["datetime"]).dt.weekday

In [22]:
bike.head()

              datetime  season  holiday  ...  registered  count  day
0  2011-01-01 00:00:00       1        0  ...          13     16    5
1  2011-01-01 01:00:00       1        0  ...          32     40    5
2  2011-01-01 02:00:00       1        0  ...          27     32    5
3  2011-01-01 03:00:00       1        0  ...          10     13    5
4  2011-01-01 04:00:00       1        0  ...           1      1    5

[5 rows x 13 columns]

In [24]:
bike["day"].unique()

array([5, 6, 0, 1, 2, 3, 4])

In [25]:
model = ols(formula="registered ~ C(day)", data = bike).fit()
anova_lm(model)

               df        sum_sq        mean_sq          F        PR(>F)
C(day)        6.0  3.476548e+06  579424.624647  25.745562  1.466566e-30
Residual  10879.0  2.448407e+08   22505.806243        NaN           NaN

In [29]:
result = pairwise_tukeyhsd(bike["registered"], bike["day"])

In [31]:
print(result)

 Multiple Comparison of Means - Tukey HSD, FWER=0.05
======================================================
group1 group2 meandiff p-adj   lower    upper   reject
------------------------------------------------------
     0      1   6.1979    0.9  -9.7188  22.1146  False
     0      2    5.343    0.9 -10.5427  21.2287  False
     0      3  12.7424 0.2132  -3.1383   28.623  False
     0      4   6.2956    0.9  -9.6471  22.2384  False
     0      5 -27.5063  0.001 -43.3091 -11.7036   True
     0      6 -36.7583  0.001 -52.5734 -20.9431   True
     1      2  -0.8549    0.9 -16.7716  15.0618  False
     1      3   6.5445 0.8863  -9.3671  22.4561  False
     1      4   0.0977    0.9 -15.8759  16.0713  False
     1      5 -33.7042  0.001 -49.5381 -17.8704   True
     1      6 -42.9562  0.001 -58.8024 -27.1099   True
     2      3   7.3994 0.7916  -8.4813    23.28  False
     2      4   0.9526    0.9 -14.9901  16.8954  False
     2      5 -32.8493  0.001 -48.6521 -17.0466   True
     2      6 -42.1013  0.001 -57.9164 -26.2861   True
     3      4  -6.4467 0.8981 -22.3844   9.4909  False
     3      5 -40.2487  0.001 -56.0464 -24.4511   True
     3      6 -49.5006  0.001 -65.3107 -33.6906   True
     4      5  -33.802  0.001 -49.6621 -17.9419   True
     4      6 -43.0539  0.001 -58.9264 -27.1815   True
     5      6  -9.2519 0.5798 -24.9838   6.4799  False
------------------------------------------------------